<a href="https://colab.research.google.com/github/bobby360/ML_Stage4/blob/master/Stage4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Setting up kaggle.

In [0]:
#Setting up Kaggle
!pip install kaggle
!mkdir .kaggle
import json
token = {"username":"bobbyml","key":"ac9a2a8daab26dce1c864312a6705acf"}
with open('/content/.kaggle/kaggle.json', 'w') as file:
    json.dump(token, file)

Requirement already satisfied: kaggle in /usr/local/lib/python3.6/dist-packages (1.5.6)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.6/dist-packages (from kaggle) (2.5.3)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from kaggle) (2.21.0)
Requirement already satisfied: tqdm in /usr/local/lib/python3.6/dist-packages (from kaggle) (4.28.1)
Requirement already satisfied: urllib3<1.25,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from kaggle) (1.24.3)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.6/dist-packages (from kaggle) (1.12.0)
Requirement already satisfied: certifi in /usr/local/lib/python3.6/dist-packages (from kaggle) (2019.9.11)
Requirement already satisfied: python-slugify in /usr/local/lib/python3.6/dist-packages (from kaggle) (3.0.4)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->kaggle) (3.0.4)
Requirement already satisfied: idna<2.9,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->kaggle) (2.8)
Requirement already satisfied: text-unidecode>=1.3 in /usr/local/lib/python3.6/dist-packages (from python-slugify->kaggle) (1.3)
mkdir: cannot create directory ‘.kaggle’: File exists

In [0]:
!cp /content/.kaggle/kaggle.json ~/.kaggle/kaggle.json

In [0]:
!kaggle config set -n path -v{/content}

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
- path is now set to: {/content}

In [0]:
#Downloading the dataset
!kaggle datasets download -d snap/amazon-fine-food-reviews -p /content

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
amazon-fine-food-reviews.zip: Skipping, found more recently modified local copy (use --force to force download)

In [74]:
#Unzipping
!unzip /content/amazon-fine-food-reviews.zip

Archive:  /content/amazon-fine-food-reviews.zip
replace Reviews.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: Y
  inflating: Reviews.csv             Y

replace database.sqlite? [y]es, [n]o, [A]ll, [N]one, [r]ename:   inflating: database.sqlite         Y

replace hashes.txt? [y]es, [n]o, [A]ll, [N]one, [r]ename:   inflating: hashes.txt

In [0]:
import pandas as pd
import numpy
import sqlite3

### **TASK 1 and 2: filtering reviews; Produce a schema where count is greater than one.**

In [76]:
# Positive review Score > 3, Negative review Score < 3
CONN = sqlite3.connect("database.sqlite")

DF = pd.read_sql_query("""select UserId, ProductId, 
                          ProfileName, Time,
                          Score, Text, COUNT(*)
                          FROM reviews
                          WHERE Score != 3
                          GROUP BY UserId
                          HAVING COUNT(*) > 1""", CONN)
DF.head()

               UserId  ... COUNT(*)
0  #oc-R115TNMSPFT9I7  ...        2
1  #oc-R11D9D7SHXIJB9  ...        3
2  #oc-R11DNU2NBKQ23Z  ...        2
3  #oc-R11O5J5ZVQE25C  ...        3
4  #oc-R12KPBODL2B5ZD  ...        2

[5 rows x 7 columns]

### **TASK 3: Sort product id in ascending order and deduplicate data.**

In [77]:
DF.sort_values('ProductId', inplace=True)
DF.drop_duplicates(subset="ProductId",
                   keep=False, inplace=True)
DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 4: How many positive and negative reviews are present in our dataset**

In [78]:
# Positive review scores: 4,5; Negative review scores 1,2
POS_REV = DF['Score'].value_counts()[4] + DF['Score'].value_counts()[5]
NEG_REV = DF['Score'].value_counts()[1] + DF['Score'].value_counts()[2]

print("There are " + str(POS_REV), 'positive reviews in the dataset')
print("There are " + str(NEG_REV), 'negative reviews in the dataset')

There are 9949 positive reviews in the dataset
There are 1844 negative reviews in the dataset

### **TASK 5: Remove the html tags**

In [79]:
from html.parser import HTMLParser

class MLStripper(HTMLParser):
    def __init__(self):
        self.reset()
        self.strict = False
        self.convert_charrefs = True
        self.fed = []
    def handle_data(self, d):
        self.fed.append(d)
    def get_data(self):
        return ''.join(self.fed)

def strip_tags(html):
    S = MLStripper()
    S.feed(html)
    return S.get_data()

DF['Text'] = DF['Text'].apply(strip_tags)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 6: Remove any punctuations or limited set of special characters**

In [80]:
import re

def remove_symbols(text):
    return re.sub("[^A-z0-9\s]+", "", text)

DF['Text'] = DF['Text'].apply(remove_symbols)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 7: Check if the word is made up of English letters and is not alpha-numeric**

In [82]:
def letters_only(text):
    return re.sub("[^a-zA-Z\s]", "", text)

DF['Text'] = DF['Text'].apply(letters_only)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 8: Check to see if the length of the word is greater than 2**

In [83]:
def check_length(text):
    text = text.split()
    contain = []

    for words in text:
        if len(words) > 2:
            contain.append(words)

    final = ' '.join(contain)
    return final

DF['Text'] = DF['Text'].apply(check_length)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 9: Convert the word to lowercase**

In [84]:
def lower_case(text):
    return text.lower()

DF['Text'] = DF['Text'].apply(lower_case)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 10: Remove Stopwords**

In [85]:
import nltk

def remove_stopwords(text):
    try:
        from nltk.corpus import stopwords
        from nltk.tokenize import word_tokenize
        stop_words = set(stopwords.words('english'))
        word_tokens = word_tokenize(text)
        filtered_sentence = [w for w in word_tokens if not w in stop_words]

    except:
        print("Downloading NLTK resources")
        nltk.download("stopwords")
        nltk.download("punkt")
        return remove_stopwords(text)

    return " ".join(filtered_sentence)

DF['Text'] = DF['Text'].apply(remove_stopwords)


DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 11: Finally Snowball Stemming the word**

In [87]:
from nltk.corpus import stopwords
from nltk.stem import SnowballStemmer
import nltk
def snow_stem(text):

    STEMMER = SnowballStemmer('english')
    WORD_TOKENS = nltk.word_tokenize(text)
    STEMMED_WORD = [STEMMER.stem(word) for word in WORD_TOKENS]
    return " ".join(STEMMED_WORD)

DF['Text'] = DF['Text'].apply(snow_stem)

DF.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]